<a href="https://colab.research.google.com/github/ManishKr19/Edureka-Data-Science/blob/main/M5_CS2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#  Read Salaries.csv as a dataframe called salary
salary = pd.read_csv(r'/content/Salaries.csv')
salary.head()

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [3]:
# Get more info on data & Verify that 148,648 records are there
print (salary.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148648 entries, 0 to 148647
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148648 non-null  int64
 1   EmployeeName      148648 non-null  object
 2   JobTitle          148648 non-null  object
 3   BasePay           148043 non-null  float64
 4   OvertimePay       148648 non-null  float64
 5   OtherPay          148648 non-null  float64
 6   Benefits          112490 non-null  float64
 7   TotalPay          148648 non-null  float64
 8   TotalPayBenefits  148648 non-null  float64
 9   Year              148648 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148648 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB
None

In [4]:

# Get Some statistical summary of data
print (salary.describe())

                  Id        BasePay  ...           Year  Notes
count  148648.000000  148043.000000  ...  148648.000000    0.0
mean    74326.110220   66325.398119  ...    2012.522617    NaN
std     42911.633315   42764.898947  ...       1.117526    NaN
min         1.000000    -166.010000  ...    2011.000000    NaN
25%     37163.750000   33587.350000  ...    2012.000000    NaN
50%     74326.500000   65007.450000  ...    2013.000000    NaN
75%    111488.250000   94691.050000  ...    2014.000000    NaN
max    148654.000000  319275.010000  ...    2014.000000    NaN

[8 rows x 9 columns]

In [5]:

# Check the total salary cost per year and see how it has increased over years

sum_year = salary.groupby('Year').sum()['TotalPayBenefits']
print ( sum_year)

Year
2011    2.594113e+09
2012    3.696790e+09
2013    3.814772e+09
2014    3.821866e+09
Name: TotalPayBenefits, dtype: float64

In [6]:
# Question 1: Compute how much total salary cost has increased from year 2011 to 2014

mean_year = salary.groupby('Year').mean()['TotalPayBenefits']
print ( mean_year)

Year
2011     71743.819645
2012    100551.886807
2013    101440.519714
2014    100261.438668
Name: TotalPayBenefits, dtype: float64

In [7]:
# Question 2: Which Job Title in Year 2014 has highest mean salary
mean_title_year = salary.groupby(['Year','JobTitle']).mean()['TotalPayBenefits']
print ( mean_title_year)

Year  JobTitle
2011  ACCOUNT CLERK                      44035.664337
      ACCOUNTANT                         47429.268000
      ACCOUNTANT INTERN                  29031.742917
      ACUPUNCTURIST                      67594.400000
      ADMINISTRATIVE ANALYST             63954.867527
                                            ...
2014  Wire Rope Cable Maint Sprv        228338.090000
      Worker's Comp Supervisor 1         76964.451667
      Worker's Compensation Adjuster     97213.493846
      X-Ray Laboratory Aide              68754.120000
      Youth Comm Advisor                 52011.190000
Name: TotalPayBenefits, Length: 4136, dtype: float64

In [8]:
# Question 3: How much money could have been saved in Year 2014 by stopping OverTimePay

over_time_pay_year = salary.groupby('Year').sum()['OvertimePay']
print ( over_time_pay_year)

Year
2011    1.638191e+08
2012    1.846650e+08
2013    1.986214e+08
2014    2.059186e+08
Name: OvertimePay, dtype: float64

In [10]:
# Question 4: Which are the top 5 common job in Year 2014 
top_job_title = salary[salary['Year'] == 2014]['JobTitle'].value_counts().head(5)
print (top_job_title)

Transit Operator                2479
Special Nurse                   1478
Registered Nurse                1234
Public Svc Aide-Public Works     916
Firefighter                      815
Name: JobTitle, dtype: int64

In [11]:

# Calculate the Cost
sum_cost = 0
for index,value in top_job_title.iteritems():
    print(index,value)
    sum_cost += sum(salary[ (salary['Year']== 2014) & (salary['JobTitle'] == index)]['TotalPayBenefits'])

print (" Total Cost of Top 5 Jobs in Year 2014 ", sum_cost)

Transit Operator 2479
Special Nurse 1478
Registered Nurse 1234
Public Svc Aide-Public Works 916
Firefighter 815
 Total Cost of Top 5 Jobs in Year 2014  610269227.6600003

In [12]:
# Question 5: Who was the top earning employee across all the years

top_sal = salary.groupby('EmployeeName').sum()['TotalPayBenefits']
print((top_sal.sort_values(axis=0)))

EmployeeName
Joe Lopez              -618.13
David P Kucia           -33.89
Mark E Laherty           -8.20
Timothy E Gibson         -2.73
Mark W Mcclure            0.00
                       ...
Richard Lee         1268668.84
Stanley Lee         1457279.68
William Wong        1459954.17
Steven Lee          1706550.76
Kevin Lee           1778487.17
Name: TotalPayBenefits, Length: 110809, dtype: float64